tutorials/combustion/fireFoam/les/simplePMMApanel/system/makeFaceSet.setSet
faceSet coupledPatch new patchToFace coupledPatch
faceZoneSet panel new setToFaceZone coupledPatch

